-------------------------------------------------------------------------
每日一练
1.（继承）根据需求，完成如下代码（按照标准格式写，抽取父类，使用继承），并在测试类中进行测试。
	需求一：
		项目经理类 
			属性：姓名 工号 工资 奖金
			行为：工作work
		程序员类
			属性：姓名 工号 工资
			行为：工作work
	需求二：
		已知学生类和老师类如下：
			属性:姓名,年龄
			行为:吃饭(其中，老师吃工作餐，学生吃学生餐)
			老师有特有的方法:讲课
			学生有特有的方法:学习
	需求三：
		已知猫类和狗类：
			属性:毛的颜色,腿的个数
			行为:吃饭
			猫特有行为:抓老鼠catchMouse
			狗特有行为:看家lookHome
2、根据需求，完成如下代码（使用抽象类、按照标准格式写），并在测试类中进行测试。
	需求一：
		具体事物：基础班老师，就业班老师
		共性：姓名，年龄，讲课。
		特性：
			基础班老师讲JavaSE
			就业班老师讲Android

	需求二：
		具体事物:基础班学生,就业班学生
		共性:姓名,年龄,学习
		特性：
			基础班学生学JavaSE
			就业班学生学Android

	需求三：
		已知猫类和狗类：
			属性:毛的颜色,腿的个数
			行为:吃饭
			猫特有行为:抓老鼠catchMouse
			狗特有行为:看家lookHome


-------------------------------------------------------------------------

