1、
	 map中有如下数据：(茄子=2，黄瓜=2.5，西红柿=5，土豆=3，豆角=3.5)
	 a、实现一个询问价格的方式(获取用户在控制台输入的蔬菜名称，然后在该map集合中查询对应的价格)有，
	 则输出相对应的价格，如果没有则提示用户"已经卖完"
	 b、将黄瓜的价格上调1元(不能直接赋值3.5)
	 c、将所有输出的价格大于3的蔬菜名称存放到当前项目根目录下，文件名自定义	 
	 

2、
	 1、定义一个String类型的对象，在对象中存放8位数字。要求：
		A：将字符串索引为3的字符查询出来，并且用a进行替换
		B：使用两种方法在字符串后追加"bcdefd"
		C：将新的字符串中索引能被3整除不能被6整除的字符打印出来
	
	 注：每个需求都需要输出验证

3、	
	  3、运用递归将 D:\\kstest文件夹下所有的图片复制到D盘符下"pictures"文件夹中
	  PS：
	 	1、格式只需要考虑：jpg、png、gif;
	  	2、需要判断"pictures" 文件夹是否存在;若不存在则用代码创建该文件夹
	 	3、D:\\kstest文件夹可以手动创建，可以放一些测试数据(每种格式的图片至少各创建一张),考试结束后测试数据不要删除
	
	
	
