-------------------------------------------------------------------------
每日一练
1.定义一个集合，初始化，然后完成如下功能：
   （1）定义一个方法swap()传入集合和两个角标使集合中元素交换位置
   （2）把集合中的元素反转
     /*
	  思路：
		a,定义循环, 循环size()/2次
		b,第一次交换第一个和最后一个, 第二次交换第二个和倒数第二个
	 */
	 (3)定义一个replaceAll方法,将传入的新值替换集合中的老值(list,old,new)
	
2.把集合中存储多个Person对象,Person有姓名和年龄,找出年龄最大的
   /*思路：
	a,定义一个Person类型的变量, 先记住第一个元素
	b,循环遍历集合
	c,用每一个元素和变量比较年龄, 如果集合中的元素比变量记住的年龄大
	d,用变量记住这个年龄较大的元素
	e,返回变量记住的元素
   */
 3.从键盘中录入3个人的信息（姓名、年龄、性别、电话、住址），并封装成对象，最后把对象存储在集合中。
 并做简单的代码实现
[要求：使用两个方式   集合转为数组、迭代器]

-------------------------------------------------------------------------
精益求精附加题（加分题）：

-------------------------------------------------------------------------